coocox/cox/Holtek/HT32F125x/cmsis_lib/lib/Src/ht32f125x_adc.c
/*********************************************************************************************************//**
 * @file    ht32f125x_adc.c
 * @version V1.0
 * @date    04/11/2011
 * @brief   This file provides all the firmware functions about ADC.
 *************************************************************************************************************
 *
 * <h2><center>Copyright (C) 2011 Holtek Semiconductor Inc. All rights reserved</center></h2>
 *
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f125x_adc.h"
#include "ht32f125x_rstcu.h"

/** @addtogroup HT32F125x_Peripheral_Driver HT32F125x Peripheral Driver
  * @{
  */

/** @defgroup  ADC ADC
  * @brief ADC driver modules
  * @{
  */

/** @defgroup ADC_Private_TypesDefinitions ADC private types definitions
  * @{
  */

/**
  * @}
  *//* End of ADC_Private_TypesDefinitions group */

/** @defgroup ADC_Private_Define ADC private definitions
  * @{
  */
#define ADC_SOFTWARE_RESET   (u32)0x00000001
#define LST_SEQ_SET          (u32)0x0000001F
#define RST_SET              (u32)0x00000001
#define TCR_SC_SET           (u32)0x00000001
#define HTCR_HSC_SET         (u32)0x00000001
/* ADC ADON mask */
#define ADC1_ON              ((u32)0x1 << 19 )

/**
  * @}
  *//* End of GPIO_Private_Define group */

/** @defgroup ADC_Private_Macro ADC private macros
  * @{
  */

/**
  * @}
  *//* End of GPIO_Private_Macro group */

/** @defgroup ADC_Private_Variable ADC private variables
  * @{
  */

/**
  * @}
  */


/** @defgroup ADC_Private_Function_Prototype ADC private function prototypes
  * @{
  */

/**
  * @}
  */


/** @defgroup ADC_Private_Function ADC private functions
  * @{
  */

/*********************************************************************************************************//**
 * @brief Deinitialize the ADCx peripheral registers to their default reset values.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @retval None
 ************************************************************************************************************/
void ADC_DeInit(ADC_TypeDef* ADCx)
{
  /* Check the parameters */
  Assert_Param(IS_ADC(ADCx));

  RSTCU_APBPerip1Reset(RSTCU_APBRST1_ADC, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Initialize the ADC peripheral according to the specified parameters in the ADC_InitStruct.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_InitStructure: pointer to a ADC_InitTypeDef structure that contains the configuration information
 *        for the specified ADC peripheral.
 * @retval None
 ************************************************************************************************************/
void ADC_Init(ADC_TypeDef* ADCx, ADC_InitTypeDef* ADC_InitStructure)
{ 
  u32 tmpreg = 0x00;
  /* Check the parameters */  
  Assert_Param(IS_ADC(ADCx));

  /*---------------------------- ADC Regular CONF Configuration --------------------------------------------*/
  tmpreg &= 0x00;

  tmpreg |= (u32)ADC_InitStructure->ADC_ConversionMode;

  ADCx->CONV = tmpreg;

  /*---------------------------- ADC High-priority CONF Configuration --------------------------------------*/
  tmpreg &= 0x00;

  tmpreg |= (u32)ADC_InitStructure->ADC_HPCCMode;

  ADCx->HCONV = tmpreg;

  /*---------------------------- ADC Trigger Control TCR Configuration -------------------------------------*/
  tmpreg &= 0x00;

  tmpreg |= (u32)ADC_InitStructure->ADC_TriggerMode;

  ADCx->TCR = tmpreg;
  /*---------------------------- ADC Trigger Control TSR Configuration -------------------------------------*/
  tmpreg &= 0x00;

  tmpreg |= (u32)ADC_InitStructure->ADC_ExtiTriggerSource;
  tmpreg |= (u32)ADC_InitStructure->ADC_ETPUTriggerChannel;
  tmpreg |= (u32)ADC_InitStructure->ADC_TPTriggerChannel;
  ADCx->TSR = tmpreg;

  /*---------------------------- ADC Trigger Control TCR Configuration -------------------------------------*/
  tmpreg &= 0x00;
  tmpreg |= (u32)ADC_InitStructure->ADC_HPTriggerMode;

  ADCx->HTCR = tmpreg;
  /*---------------------------- ADC Trigger Control TSR Configuration -------------------------------------*/
  tmpreg &= 0x00;
  tmpreg |= (u32)ADC_InitStructure->ADC_HPExtiTriggerSource;
  tmpreg |= (u32)ADC_InitStructure->ADC_HPETPUTriggerChannel;
  tmpreg |= (u32)ADC_InitStructure->ADC_HPTPTriggerChannel;
  ADCx->HTSR = tmpreg;
}

/*********************************************************************************************************//**
 * @brief Reset ADC.
 * @param ADCx: is the selected ADC from the ADC peripherals.
 * @retval None
 ************************************************************************************************************/
void ADC_Reset(ADC_TypeDef* ADCx)
{
  /* Check the parameters */ 
  Assert_Param(IS_ADC(ADCx));

  /*---------------------------- Reset ADC -----------------------------------------------------------------*/                                                                                       
  ADCx->RST |= ADC_SOFTWARE_RESET;
}


/*********************************************************************************************************//**
 * @brief Enable or Disable the specified ADC interrupts.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_INT: Specify the ADC interrupt sources that is to be enabled or disabled.
          this parameter can be any combination of the following values:
             @arg ADC_INT_SINGLE_EOC:
             @arg ADC_INT_SUB_GROUP_EOC:
             @arg ADC_INT_CYCLE_EOC:
             @arg ADC_INT_DATA_OVERWRITE:
             @arg ADC_INT_HP_SINGLE_EOC:
             @arg ADC_INT_HP_SUB_GROUP_EOC:
             @arg ADC_INT_HP_CYCLE_EOC:
             @arg ADC_INT_HP_DATA_OVERWRITE:
             @arg ADC_INT_AWD_LOWER:
             @arg ADC_INT_AWD_UPPER:
 * @param NewState new state of the specified ADC interrupts.
          This parameter can be: ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void ADC_IntConfig(ADC_TypeDef* ADCx, u32 ADC_INT, ControlStatus NewState)
{
  /* Check the parameters */
  Assert_Param(IS_ADC(ADCx));
  Assert_Param(IS_ADC_INT(ADC_INT));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if(NewState != DISABLE)
  {
    ADCx->IM |= ADC_INT ;
  }
  else
  {
    ADCx->IM &= ~ADC_INT ;
  }
}

