coocox/cox/Holtek/HT32F125x/cmsis_lib/lib/Src/ht32f125x_adc.c
/*********************************************************************************************************//**
 * @brief Check whether the specified ADC interrupt has occurred.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_INT: Specify the interrupt status to check.
                     This parameter can be any combination of the following values:
                     @arg ADC_INT_SINGLE_EOC:
                     @arg ADC_INT_SUB_GROUP_EOC:
                     @arg ADC_INT_CYCLE_EOC:
                     @arg ADC_INT_DATA_OVERWRITE:
                     @arg ADC_INT_HP_SINGLE_EOC:
                     @arg ADC_INT_HP_SUB_GROUP_EOC:
                     @arg ADC_INT_HP_CYCLE_EOC:
                     @arg ADC_INT_HP_DATA_OVERWRITE:
                     @arg ADC_INT_AWD_LOWER:
                     @arg ADC_INT_AWD_UPPER:
 * @return SET or RESET
 ************************************************************************************************************/
FlagStatus ADC_GetIntStatus(ADC_TypeDef* ADCx, u32 ADC_INT)
{
  FlagStatus Status;

  /* Check the parameters */
  Assert_Param(IS_ADC(ADCx));
  Assert_Param(IS_ADC_INT(ADC_INT));

  if((ADCx->IMASK & ADC_INT) != 0x0)
  {
    Status = SET ;
  }
  else
  {
    Status = RESET ;
  }

  return Status ;
}

/*********************************************************************************************************//**
 * @brief Check whether the specified ADC flag has been set.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_FLAG: Specify the flag to check.
          This parameter can be any combination of the following values:
             @arg ADC_FLAG_SINGLE_EOC:
             @arg ADC_FLAG_SUB_GROUP_EOC:
             @arg ADC_FLAG_CYCLE_EOC:
             @arg ADC_FLAG_DATA_OVERWRITE:
             @arg ADC_FLAG_HP_SINGLE_EOC:
             @arg ADC_FLAG_HP_SUB_GROUP_EOC:
             @arg ADC_FLAG_HP_CYCLE_EOC:
             @arg ADC_FLAG_HP_DATA_OVERWRITE:
             @arg ADC_FLAG_AWD_LOWER:
             @arg ADC_FLAG_AWD_UPPER:
 * @return SET or RESET
 ************************************************************************************************************/
FlagStatus ADC_GetFlagStatus(ADC_TypeDef* ADCx, u32 ADC_FLAG)
{
  FlagStatus Status;

  /* Check the parameters */
  Assert_Param(IS_ADC(ADCx));
  Assert_Param(IS_ADC_FLAG(ADC_FLAG));

  if((ADCx->IRAW & ADC_FLAG) != 0x0)
  {
    Status = SET ;
  }
  else
  {
    Status = RESET ;
  }

  return Status ;
}

/*********************************************************************************************************//**
 * @brief Clear the ADCx interrupt pending bits.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_INT: Specify the interrupt pending bits to be cleared.
          This parameter can be any combination of the following values:
             @arg ADC_INT_SINGLE_EOC:
             @arg ADC_INT_SUB_GROUP_EOC:
             @arg ADC_INT_CYCLE_EOC:
             @arg ADC_INT_DATA_OVERWRITE:
             @arg ADC_INT_HP_SINGLE_EOC:
             @arg ADC_INT_HP_SUB_GROUP_EOC:
             @arg ADC_INT_HP_CYCLE_EOC:
             @arg ADC_INT_HP_DATA_OVERWRITE:
             @arg ADC_INT_AWD_LOWER:
             @arg ADC_INT_AWD_UPPER:
 * @retval None
 ************************************************************************************************************/
void ADC_ClearIntPendingBit(ADC_TypeDef* ADCx, u32 ADC_INT)
{
  /* Check the parameters */
  Assert_Param(IS_ADC(ADCx));
  Assert_Param(IS_ADC_INT(ADC_INT));

  ADCx->ICLR = ADC_INT ;
}

/*********************************************************************************************************//**
 * @brief Clear the ADC pending flags.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_FLAG: Specify the interrupt pending bits to be cleared.
          This parameter can be any combination of the following values:
             @arg ADC_FLAG_SINGLE_EOC:
             @arg ADC_FLAG_SUB_GROUP_EOC:
             @arg ADC_FLAG_CYCLE_EOC:
             @arg ADC_FLAG_DATA_OVERWRITE:
             @arg ADC_FLAG_HP_SINGLE_EOC:
             @arg ADC_FLAG_HP_SUB_GROUP_EOC:
             @arg ADC_FLAG_HP_CYCLE_EOC:
             @arg ADC_FLAG_HP_DATA_OVERWRITE:
             @arg ADC_FLAG_AWD_LOWER:
             @arg ADC_FLAG_AWD_UPPER:
 * @retval None
 ************************************************************************************************************/
void ADC_ClearFlag(ADC_TypeDef* ADCx, u32 ADC_FLAG)
{
  /* Check the parameters */
  Assert_Param(IS_ADC(ADCx));
  Assert_Param(IS_ADC_FLAG(ADC_FLAG));

  ADCx->ICLR = ADC_FLAG ;
}

/*********************************************************************************************************//**
 * @brief Configure the ADCx external trigger for regular channels conversion.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_ExtTrigRegularConv:
          This parameter can be one of the following values:
            @arg ADC_EXT_TRIG_NONE       : Trigger disable
            @arg ADC_EXT_TRIG_SW         : S/W trigger
            @arg ADC_EXT_TRIG_GPTMx_TRGO : where x can be 0 ~ 1
            @arg ADC_EXT_TRIG_GPTMx_CH1O : where x can be 0 ~ 1
            @arg ADC_EXT_TRIG_GPTMx_CH2O : where x can be 0 ~ 1
            @arg ADC_EXT_TRIG_GPTMx_CH3O : where x can be 0 ~ 1
            @arg ADC_EXT_TRIG_GPTMx_CH4O : where x can be 0 ~ 1
            @arg ADC_EXT_TRIG_EXTI_x     : where x can be 0 ~ 15
 * @retval None
 ************************************************************************************************************/
void ADC_ExtTrigRegularConvConfig(ADC_TypeDef* ADCx, u32 ADC_ExtTrigRegularConv)
{
  /* Check the parameters */
  Assert_Param(IS_ADC(ADCx));
  Assert_Param(IS_ADC_EXT_TRIG(ADC_ExtTrigRegularConv));

  /* Config external trigger conversion source of regular group */
  ADCx->TCR = ADC_ExtTrigRegularConv >> 28 ;
  ADCx->TSR = ADC_ExtTrigRegularConv ;
}

