coocox/cox/Holtek/HT32F125x/cmsis_lib/lib/Src/ht32f125x_adc.c
/*********************************************************************************************************//**
 * @brief Configure the ADCx external trigger for high priority channels conversion.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_ExtTrigHPConv: 
          This parameter can be one of the following values:
            @arg ADC_EXT_TRIG_NONE       : Trigger disable
            @arg ADC_EXT_TRIG_SW         : S/W trigger
            @arg ADC_EXT_TRIG_GPTMx_TRGO : where x can be 0 ~ 1
            @arg ADC_EXT_TRIG_GPTMx_CH1O : where x can be 0 ~ 1
            @arg ADC_EXT_TRIG_GPTMx_CH2O : where x can be 0 ~ 1
            @arg ADC_EXT_TRIG_GPTMx_CH3O : where x can be 0 ~ 1
            @arg ADC_EXT_TRIG_GPTMx_CH4O : where x can be 0 ~ 1
            @arg ADC_EXT_TRIG_EXTI_x     : where x can be 0 ~ 15
 * @retval None
 ************************************************************************************************************/
void ADC_ExtTrigHPConvConfig(ADC_TypeDef* ADCx, u32 ADC_ExtTrigHPConv)
{
  /* Check the parameters */
  Assert_Param(IS_ADC(ADCx));
  Assert_Param(IS_ADC_EXT_TRIG(ADC_ExtTrigHPConv));

  /* Config external trigger conversion source of high priority group */
  ADCx->HTCR = ADC_ExtTrigHPConv >> 28 ;
  ADCx->HTSR = ADC_ExtTrigHPConv ;
}

/*********************************************************************************************************//**
 * @brief Configure cyclic conversion mode and length of list queue for regular group.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_MODE: ADC Cyclic Conversion Mode
          This parameter can be one of following.
           @arg ONE_SHOT_MODE:
           @arg CONTINUOUS_MODE:
           @arg DISCONTIOUS_MODE:
 * @param Length: must between 1 ~ 16
 * @param SubLength: must between 1 ~ 16
 * @retval None
 ************************************************************************************************************/
void ADC_RegularGroupConfig(ADC_TypeDef* ADCx, u8 ADC_MODE, u8 Length, u8 SubLength)
{
  /* Check the parameters */
  Assert_Param(IS_ADC(ADCx));
  Assert_Param(IS_ADC_CYCLIC_CONVERSION_MODE(ADC_MODE));
  Assert_Param(IS_ADC_REGULAR_LENGTH(Length));
  Assert_Param(IS_ADC_REGULAR_SUB_LENGTH(SubLength));

  /* Config cyclic conversion mode and length of list queue and sub length for regular group */
  ADCx->CONV =  ((u32)(SubLength - 1) << 16) | ((u32)(Length - 1) << 8) | ADC_MODE ;
}

/*********************************************************************************************************//**
 * @brief Configure cyclic conversion mode and length of list queue for high priority group.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_MODE: ADC Cyclic Conversion Mode
          This parameter can be one of following.
           @arg ONE_SHOT_MODE:
           @arg CONTINUOUS_MODE:
           @arg DISCONTIOUS_MODE:
 * @param Length: must between 1 ~ 4
 * @param SubLength: must between 1 ~ 4
 * @retval None
 ************************************************************************************************************/
void ADC_HPGroupConfig(ADC_TypeDef* ADCx, u8 ADC_MODE, u8 Length, u8 SubLength)
{
  /* Check the parameters */
  Assert_Param(IS_ADC(ADCx));
  Assert_Param(IS_ADC_CYCLIC_CONVERSION_MODE(ADC_MODE));
  Assert_Param(IS_ADC_HP_LENGTH(Length));
  Assert_Param(IS_ADC_HP_SUB_LENGTH(SubLength));

  /* Config cyclic conversion mode and length of list queue and sub length for high priority group */
  ADCx->HCONV =  ((u32)(SubLength - 1) << 16) | ((u32)(Length - 1) << 8) | ADC_MODE ;
}

/*********************************************************************************************************//**
 * @brief Return the result of ADC high priority channel conversion.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_HP_DATAx : where x can be 0 ~ 3
 * @return The Data conversion value.
 ************************************************************************************************************/
u16 ADC_GetHPConversionData(ADC_TypeDef* ADCx, u8 ADC_HP_DATAx)
{
  /* Check the parameters */
  Assert_Param(IS_ADC(ADCx));
  Assert_Param(IS_ADC_HP_DATA(ADC_HP_DATAx));

  return ((u16)ADCx->HDR[ADC_HP_DATAx]) ;
}

/*********************************************************************************************************//**
 * @brief Return the result of ADC regular channel conversion.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_REGULAR_DATAx : where x can be 0 ~ 15
 * @return The Value of data conversion.
 ************************************************************************************************************/
u16 ADC_GetConversionData(ADC_TypeDef* ADCx, u8 ADC_REGULAR_DATAx)
{
  /* Check the parameters */
  Assert_Param(IS_ADC(ADCx));
  Assert_Param(IS_ADC_REGULAR_DATA(ADC_REGULAR_DATAx));

  return ((u16)ADCx->DR[ADC_REGULAR_DATAx]) ;
}

/*********************************************************************************************************//**
 * @brief Configure the corresponding rank in the sequencer and the sample time for the regular channel of the selected ADC.
 * @param ADCx: where ADCx is the selected ADC from the ADC peripherals.
 * @param ADC_Channel: the ADC channel to configure
            This parameter can be one of the following values:
              @arg ADC_CH_x: ADC Channel x selected, x must between 0 ~ 7
              @arg ADC_CH_GNDREF: ADC AGNDREF selected
              @arg ADC_CH_VREF: ADC VREF selected
 * @param Rank: The rank in the regular group sequencer.
            This parameter must be between 0 to 15.
 * @param SampleClock: Number of sampling clocks.
            This parameter must be between 0x00 to 0xFF .
 * @retval None
 ************************************************************************************************************/
void ADC_RegularChannelConfig(ADC_TypeDef* ADCx, u8 ADC_Channel, u8 Rank, u8 SampleClock)
{
  u32 tmpreg1 = 0, tmpreg2 = 0 ;

  /* Check the parameters */ 
  Assert_Param(IS_ADC(ADCx));
  Assert_Param(IS_ADC_CHANNEL(ADC_Channel));
  Assert_Param(IS_ADC_REGULAR_RANK(Rank));
  Assert_Param(IS_ADC_INPUT_SAMPLING_TIME(SampleClock));  
  /* config sampling clock of correspond ADC input channel */
  ADCx->STR[ADC_Channel] = SampleClock ;

